//#include <string>
//#include <vector>
//
//using namespace std;
//
//int check[2000] = {0,};
//
//
///*
//
//1Ä­À» ¶Ù´Â ¹ý 1
//1Ä­
//
//2Ä­À» ¶Ù´Â ¹ý 2
//2Ä­
//1Ä­ 1Ä­
//
//
//
//3Ä­À» ¶Ù´Â¹ý 3
//2Ä­ 1Ä­
//1Ä­ 2Ä­
//1Ä­ 1Ä­ 1Ä­
//
//
//
//4Ä­À» ¶Ù´Â ¹ý 5
//
//2Ä­ 2Ä­
//1Ä­ 1Ä­ 1Ä­ 1Ä­
//1Ä­ 2Ä­ 1Ä­
//1Ä­ 1Ä­ 2Ä­
//2Ä­ 1Ä­ 1Ä­
//
//
//
//
//5Ä­À» ¶Ù´Â ¹ý 8
//
//1,1,1,1,1
//
//2,2,1
//1,2,2
//2,1,2
//
//1,1,1,2
//1,1,1,2,
//1,1,2,1,
//1,2,1,1,
//
//
//
//
//*/
//
//
//long long solution(int n) {
//    long long answer = 0;
//
//    check[0] = 0;
//    check[1] = 1;
//    check[2] = 2;
//    
//    for (int i = 3;i <= n;i++)
//    {
//        check[i] = (check[i - 2] * check[i - 1]) % 1234567;
//    }
//   
//    return check[n];
//}
//
//
//int main()
//{
//
//    int n = 4;
//    solution(n);
//    
//    return 0;
//}